# Banco de Dados - Prof. Sérgio Lifschitz

---

## Exercícios da Aula 2: Projeto Conceitual e Linguagem SQL DDL (criação e atualização de esquemas) e SQL DML (atualização de instâncias)

**Primeira Parte:** Projeto Conceitual com Diagramas ER

Acesse o enunciado do exercício no seguinte link: https://drive.google.com/file/d/1Sd8Nd1nraKALk-GqRszRCu4MZqmBDBE5/view?usp=sharing

Você irá praticar com a ferramenta BRmodelo.

Ao final deste COLAB, publicamos uma possível solução.

**Segunda Parte:** Voltamos a utilizar o SGBD PostgreSQL localmente.

Para a prática de SQL DML (atualização de instâncias) usando um esquema similar ao esquema CARROS da Aula 1.

## PASSO 1: Instalação e Configuração do PostgreSQL

Basta dar PLAY que o script abaixo instalará o SGBD PostgreSQL

In [ ]:
# %%capture
# Instalação do PostgreSQL
!sudo apt-get -y -qq update
!pip install sqlalchemy==2.0
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start
# Alterando a senha do usuário padrão 'postgres' para 'postgres'
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

W: Skipping acquire of configured file 'main/source/Sources' as repository 'https://r2u.stat.illinois.edu/ubuntu jammy InRelease' does not seem to provide it (sources.list entry misspelt?)
Collecting sqlalchemy==2.0
  Downloading SQLAlchemy-2.0.0-py3-none-any.whl.metadata (9.3 kB)
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.12/dist-packages (from sqlalchemy==2.0) (4.15.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.12/dist-packages (from sqlalchemy==2.0) (3.2.4)
Downloading SQLAlchemy-2.0.0-py3-none-any.whl (1.8 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.8/1.8 MB 20.8 MB/s eta 0:00:00
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 2.0.44
    Uninstalling SQLAlchemy-2.0.44:
      Successfully uninstalled SQLAlchemy-2.0.44
Successfully installed sqlalchemy-2.0.0
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78, <> line 13.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:
Selecting previously unselected package logrotate.
(Reading database ... 126718 files and directories currently installed.)
Preparing to unpack .../00-logrotate_3.19.0-1ubuntu1.1_amd64.deb ...
Unpacking logrotate (3.19.0-1ubuntu1.1) ...
Selecting previously unselected package netbase.
Preparing to unpack .../01-netbase_6.3_all.deb ...
Unpacking netbase (6.3) ...
Selecting previously unselected package libcommon-sense-perl:amd64.
Preparing to unpack .../02-libcommon-sense-perl_3.75-2build1_amd64.deb ...
Unpacking libcommon-sense-perl:amd64 (3.75-2build1) ...
Selecting previously unselected package libjson-perl.
Preparing to unpack .../03-libjson-perl_4.04000-1_all.deb ...
Unpacking libjson-perl (4.04000-1) ...
Selecting previously unselected package libtypes-serialiser-perl.
Preparing to unpack .../04-libtypes-serialiser-perl_1.01-1_all.deb ...
Unpacking libtypes-serialiser-perl (1.01-1) ...
Selecting previously unselected package libjson-xs-perl.
Preparing to unpack .../05-libjson-xs-perl_4.040-0ubuntu0.22.04.1_amd64.deb ...
Unpacking libjson-xs-perl (4.040-0ubuntu0.22.04.1) ...
Selecting previously unselected package postgresql-client-common.
Preparing to unpack .../06-postgresql-client-common_238_all.deb ...
Unpacking postgresql-client-common (238) ...
Selecting previously unselected package postgresql-client-14.
Preparing to unpack .../07-postgresql-client-14_14.19-0ubuntu0.22.04.1_amd64.deb ...
Unpacking postgresql-client-14 (14.19-0ubuntu0.22.04.1) ...
Selecting previously unselected package ssl-cert.
Preparing to unpack .../08-ssl-cert_1.1.2_all.deb ...
Unpacking ssl-cert (1.1.2) ...
Selecting previously unselected package postgresql-common.
Preparing to unpack .../09-postgresql-common_238_all.deb ...
Adding 'diversion of /usr/bin/pg_config to /usr/bin/pg_config.libpq-dev by postgresql-common'
Unpacking postgresql-common (238) ...
Selecting previously unselected package postgresql-14.
Preparing to unpack .../10-postgresql-14_14.19-0ubuntu0.22.04.1_amd64.deb ...
Unpacking postgresql-14 (14.19-0ubuntu0.22.04.1) ...
Selecting previously unselected package postgresql.
Preparing to unpack .../11-postgresql_14+238_all.deb ...
Unpacking postgresql (14+238) ...
Selecting previously unselected package sysstat.
Preparing to unpack .../12-sysstat_12.5.2-2ubuntu0.2_amd64.deb ...
Unpacking sysstat (12.5.2-2ubuntu0.2) ...
Setting up logrotate (3.19.0-1ubuntu1.1) ...
Created symlink /etc/systemd/system/timers.target.wants/logrotate.timer → /lib/systemd/system/logrotate.timer.
Setting up libcommon-sense-perl:amd64 (3.75-2build1) ...
Setting up ssl-cert (1.1.2) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Setting up libtypes-serialiser-perl (1.01-1) ...
Setting up libjson-perl (4.04000-1) ...
Setting up netbase (6.3) ...
Setting up sysstat (12.5.2-2ubuntu0.2) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline

Creating config file /etc/default/sysstat with new version
update-alternatives: using /usr/bin/sar.sysstat to provide /usr/bin/sar (sar) in auto mode
Created symlink /etc/systemd/system/sysstat.service.wants/sysstat-collect.timer → /lib/systemd/system/sysstat-collect.timer.
Created symlink /etc/systemd/system/sysstat.service.wants/sysstat-summary.timer → /lib/systemd/system/sysstat-summary.timer.
Created symlink /etc/systemd/system/multi-user.target.wants/sysstat.service → /lib/systemd/system/sysstat.service.
Setting up postgresql-client-common (238) ...
Setting up libjson-xs-perl (4.040-0ubuntu0.22.04.1) ...
Setting up postgresql-client-14 (14.19-0ubuntu0.22.04.1) ...
update-alternatives: using /usr/share/postgresql/14/man/man1/psql.1.gz to provide /usr/share/man/man1/psql.1.gz (psql.1.gz) in auto mode
Setting up postgresql-common (238) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Adding user postgres to group ssl-cert

Creating config file /etc/postgresql-common/createcluster.conf with new version
Building PostgreSQL dictionaries from installed myspell/hunspell packages...
Removing obsolete dictionary files:
Created symlink /etc/systemd/system/multi-user.target.wants/postgresql.service → /lib/systemd/system/postgresql.service.
Setting up postgresql-14 (14.19-0ubuntu0.22.04.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Creating new PostgreSQL cluster 14/main ...
/usr/lib/postgresql/14/bin/initdb -D /var/lib/postgresql/14/main --auth-local peer --auth-host scram-sha-256 --no-instructions
The files belonging to this database system will be owned by user "postgres".
This user must also own the server process.

The database cluster will be initialized with locale "en_US.UTF-8".
The default database encoding has accordingly been set to "UTF8".
The default text search configuration will be set to "english".

Data page checksums are disabled.

fixing permissions on existing directory /var/lib/postgresql/14/main ... ok
creating subdirectories ... ok
selecting dynamic shared memory implementation ... posix
selecting default max_connections ... 100
selecting default shared_buffers ... 128MB
selecting default time zone ... Etc/UTC
creating configuration files ... ok
running bootstrap script ... ok
performing post-bootstrap initialization ... ok
syncing data to disk ... ok
update-alternatives: using /usr/share/postgresql/14/man/man1/postmaster.1.gz to provide /usr/share/man/man1/postmaster.1.gz (postmaster.1.gz) in auto mode
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql (14+238) ...
Processing triggers for man-db (2.10.2-1) ...
 * Starting PostgreSQL 14 database server
   ...done.
ALTER ROLE

## PASSO 2: Preparo do Esquema Relacional CARROS2

Acesse o enunciado do exercício no seguinte link: https://drive.google.com/file/d/1B0OFWhCV8zOLt0FQ5KvCutLPhuMveZ84/view?usp=sharing

Diferentemente da aula 1, aqui você irá utilizar os comandos de criação do esquema CARROS2 propostos por você no seu próprio COLAB, seguindo as instruções do enunciado da Lista da Aula 2. Você pode utilizar os scripts do esquema CARROS da Aula 1 apenas como referência de "gabarito".

Os demais comandos (PLAY) de criação do esquema do BD Carros2 seguem iguais à aula 1.

In [ ]:
# Cria o esquema no banco de dados
%%capture
!sudo -u postgres psql -U postgres -c 'DROP SCHEMA IF EXISTS carros CASCADE;'
!sudo -u postgres psql -U postgres -c 'CREATE SCHEMA carros;'

## PASSO 3: Preparando para usar o SGBD PostgreSQL localmente

Aqui nada muda em relação à Aula 1 - configuração para extensão SQL usando o SGBD PostgreSQL no seu COLAB.

In [ ]:
# Configurando o PostgreSQL na variável de ambiente DATABASE_URL
%env DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

env: DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

In [ ]:
# Carregando a extensão sql para usar o SQL pelo Google Colab
%load_ext sql

In [ ]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## Prática de SQL DDL (esquemas) e DML (instâncias)

Criação e atualização do esquema CARROS2 implantado no SGBD PostgreSQL, seguindo as instruções dos exercícios desta aula 2.

In [ ]:
%sql postgresql://postgres:postgres@localhost:5432/postgres

In [ ]:
# Escolhe o esquema carros como o esquema em que serão feitas as consultas
# (deve-se executar essa célula sempre que for trocar para o esquema carros)
%%sql
SET SCHEMA 'carros';

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
# Exemplo de CREATE TABLE:

# Você pode modificar e adaptar ao teu próprio comando.

%%sql

CREATE TABLE carros.automoveis (
    codigo integer NOT NULL,
    ano character(2) NOT NULL,
    fabricante character(20),
    modelo character(20),
    preco_tabela numeric(8,2),
    pais character(20)
);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

CREATE TABLE carros.revendedoras (
  cnpj char(14) not null,
  nome varchar(45) not null,
  cpf_proprietario char(11) not null,
  estado char(2),
  constraint PK_revendedoras PRIMARY KEY (cnpj)
)

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

CREATE TABLE carros.consumidores (
  cpf char(11) not null,
  nome varchar(25) not null,
  sobrenome varchar(25),
  data_nascimento date,
  estado char(2),
  constraint PK_consumidores PRIMARY KEY (cpf)
)

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

CREATE TABLE carros.negocios (
  cpf_comprador char(11) not null,
  cnpj_revendedora char(14) not null,
  codigo_automovel integer not null,
  ano character(2) not null,
  data date,
  preco numeric(8,2)
)

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

CREATE TABLE carros.garagens (
  cnpj_revendedora char(14) not null,
  codigo_automovel integer not null,
  ano character(2) not null,
  quantidade integer not null
)

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

Alterar as restrições das tabelas de relacionamentos:
- Adicionar chaves primárias;
- Adicionar chaves estrangeiras;

In [ ]:
%%sql

ALTER TABLE carros.automoveis
  ADD CONSTRAINT PK_automoveis PRIMARY KEY (codigo, ano);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

ALTER TABLE carros.negocios
  ADD CONSTRAINT PK_negocios PRIMARY KEY (cpf_comprador, cnpj_revendedora, codigo_automovel, ano),
  ADD CONSTRAINT FK_negocios_consumidores FOREIGN KEY (cpf_comprador) REFERENCES Consumidores(cpf),
  ADD CONSTRAINT FK_negocios_revendedoras FOREIGN KEY (cnpj_revendedora) REFERENCES Revendedoras(cnpj),
  ADD CONSTRAINT FK_negocios_automoveis FOREIGN KEY (codigo_automovel, ano) REFERENCES Automoveis(codigo, ano)

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

ALTER TABLE carros.garagens
  ADD CONSTRAINT PK_garagens PRIMARY KEY (cnpj_revendedora, codigo_automovel, ano),
  ADD CONSTRAINT FK_garagens_revendedoras FOREIGN KEY (cnpj_revendedora) REFERENCES Revendedoras(cnpj),
  ADD CONSTRAINT FK_garagens_automoveis FOREIGN KEY (codigo_automovel, ano) REFERENCES Automoveis(codigo, ano)

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

ALTER TABLE carros.revendedoras
  ADD CONSTRAINT FK_revendedoras_consumidores FOREIGN KEY (cpf_proprietario) REFERENCES Consumidores(cpf)

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

Testando inserções

In [ ]:
%%sql

delete from carros.automoveis;

insert into carros.automoveis
values
(01, '10', 'Fiat', 'Uno Mile', 20000, 'Italia'),
(02, '11', 'Fiat', 'Uno', 20000, 'Italia'),
(03, '21', 'Fiat', 'Argo', 66679, 'Brasil'),
(04, '21', 'Fiat', 'Fiorino Working', 73216, 'Brasil'),
(05, '21', 'Hyundai', 'HB20 Vision', 60547, 'Coreia do Sul'),
(06, '11', 'Hyundai', 'Creta Action', 20000, 'Coreia do Sul'),
(07, '16', 'VW - VolksWagen', 'Fusca 2.0', 130773, 'Alemanha'),
(08, '05', 'VW - VolksWagen', 'Gol City', 14209, 'Alemanha'),
(09, '85', 'VW - VolksWagen', 'Kombi Furgão', 3765, 'Alemanha'),
(10, '26', 'GM - Chevrolet', 'ONIX HATCH', 120801, 'EUA'),
(11, '25', 'GM - Chevrolet', 'SPIN LT 1.8', 118600, 'EUA'),
(12, '14', 'GM - Chevrolet', 'Celta ADVANTAGE', 30690, 'Brasil')
;

 * postgresql://postgres:***@localhost:5432/postgres
0 rows affected.
12 rows affected.

[]

In [ ]:
%%sql

SELECT * FROM carros.automoveis;

 * postgresql://postgres:***@localhost:5432/postgres
4 rows affected.

[(1, '10', 'Fiat                ', 'Uno Mile            ', Decimal('20000.00'), 'Italia              '),
 (2, '11', 'Fiat                ', 'Uno                 ', Decimal('20000.00'), 'Italia              '),
 (3, '21', 'Fiat                ', 'Argo                ', Decimal('66679.00'), 'Brasil              '),
 (4, '21', 'Fiat                ', 'Fiorino Working     ', Decimal('73216.00'), 'Brasil              ')]

In [ ]:
%%sql

delete from carros.consumidores;

insert into carros.consumidores
values
('04924507814', 'Enrico', 'Daniel', '1978-05-17', 'AL'),
('65991658773', 'Yuri', 'Nathan', '1953-04-09', 'PB'),
('14928515668', 'Gabriela', 'Sueli', '1978-05-12', 'AC'),
('89458105285', 'Josefa', 'Yasmin', '1983-08-03', 'RS'),
('53331021474', 'Agatha', 'Nair', '1967-08-20', 'RN'),
('66984125898', 'Mariane', 'Eliane', '1967-07-23', 'RO'),
('42717588841', 'Thomas', 'Calebe', '1948-05-13', 'CE'),
('64025874946', 'Isadora', 'Sabrina', '1999-07-05', 'AM'),
('27605785690', 'Lavínia', 'Sandra', '1966-02-01', 'CE'),
('35574822008', 'Kauê', 'Ryan', '2000-11-01', 'BA')
;

 * postgresql://postgres:***@localhost:5432/postgres
0 rows affected.
10 rows affected.

[]

In [ ]:
%%sql

delete from carros.revendedoras;

insert into carros.revendedoras
values
('64790774000146', 'Rosa e Igor Alimentos ME', '04924507814', 'SP'),
('60551543000129', 'Alexandre e Anthony Eletrônica Ltda', '14928515668', 'SP'),
('16471414000139', 'Theo e Stefany Limpeza ME', '35574822008', 'AL'),
('60076179000192', 'Nicole e Lara Ferragens Ltda', '89458105285', 'AL'),
('05225673000163', 'Daniel e Alícia Advocacia ME', '42717588841', 'DF'),
('39780506000104', 'Daniel e Brenda Financeira Ltda', '27605785690', 'DF')
;

 * postgresql://postgres:***@localhost:5432/postgres
0 rows affected.
6 rows affected.

[]

In [ ]:
%%sql

delete from carros.garagens;

insert into carros.garagens
values
('64790774000146', 01, '10', 10),
('60551543000129', 03, '21', 3),
('16471414000139', 07, '16', 2),
('60076179000192', 10, '26', 5),
('05225673000163', 05, '21', 12),
('39780506000104', 08, '05', 4)
;

 * postgresql://postgres:***@localhost:5432/postgres
0 rows affected.
6 rows affected.

[]

In [ ]:
%%sql

delete from carros.negocios;

insert into carros.negocios
values
('04924507814', '64790774000146', 01, '10', '2025-10-27', 30000),
('65991658773', '60551543000129', 03, '21', '2025-10-27', 100000),
('14928515668', '16471414000139', 07, '16', '2025-10-27', 110000),
('89458105285', '60076179000192', 10, '26', '2025-10-27', 50000),
('53331021474', '05225673000163', 05, '21', '2025-10-27', 2000),
('66984125898', '39780506000104', 08, '05', '2025-10-27', 14209)
;

 * postgresql://postgres:***@localhost:5432/postgres
0 rows affected.
6 rows affected.

[]

Selecionar valores das tabelas

In [ ]:
%%sql

select * from carros.automoveis;

 * postgresql://postgres:***@localhost:5432/postgres
12 rows affected.

[(1, '10', 'Fiat                ', 'Uno Mile            ', Decimal('20000.00'), 'Italia              '),
 (2, '11', 'Fiat                ', 'Uno                 ', Decimal('20000.00'), 'Italia              '),
 (3, '21', 'Fiat                ', 'Argo                ', Decimal('66679.00'), 'Brasil              '),
 (4, '21', 'Fiat                ', 'Fiorino Working     ', Decimal('73216.00'), 'Brasil              '),
 (5, '21', 'Hyundai             ', 'HB20 Vision         ', Decimal('60547.00'), 'Coreia do Sul       '),
 (6, '11', 'Hyundai             ', 'Creta Action        ', Decimal('20000.00'), 'Coreia do Sul       '),
 (7, '16', 'VW - VolksWagen     ', 'Fusca 2.0           ', Decimal('130773.00'), 'Alemanha            '),
 (8, '05', 'VW - VolksWagen     ', 'Gol City            ', Decimal('14209.00'), 'Alemanha            '),
 (9, '85', 'VW - VolksWagen     ', 'Kombi Furgão        ', Decimal('3765.00'), 'Alemanha            '),
 (10, '26', 'GM - Chevrolet      ', 'ONIX HATCH          ', Decimal('120801.00'), 'EUA                 '),
 (11, '25', 'GM - Chevrolet      ', 'SPIN LT 1.8         ', Decimal('118600.00'), 'EUA                 '),
 (12, '14', 'GM - Chevrolet      ', 'Celta ADVANTAGE     ', Decimal('30690.00'), 'Brasil              ')]

In [ ]:
%%sql
select * from carros.consumidores;

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[('04924507814', 'Enrico', 'Daniel', datetime.date(1978, 5, 17), 'AL'),
 ('65991658773', 'Yuri', 'Nathan', datetime.date(1953, 4, 9), 'PB'),
 ('14928515668', 'Gabriela', 'Sueli', datetime.date(1978, 5, 12), 'AC'),
 ('89458105285', 'Josefa', 'Yasmin', datetime.date(1983, 8, 3), 'RS'),
 ('53331021474', 'Agatha', 'Nair', datetime.date(1967, 8, 20), 'RN'),
 ('66984125898', 'Mariane', 'Eliane', datetime.date(1967, 7, 23), 'RO'),
 ('42717588841', 'Thomas', 'Calebe', datetime.date(1948, 5, 13), 'CE'),
 ('64025874946', 'Isadora', 'Sabrina', datetime.date(1999, 7, 5), 'AM'),
 ('27605785690', 'Lavínia', 'Sandra', datetime.date(1966, 2, 1), 'CE'),
 ('35574822008', 'Kauê', 'Ryan', datetime.date(2000, 11, 1), 'BA')]

In [ ]:
%%sql
select * from carros.revendedoras;

 * postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[('64790774000146', 'Rosa e Igor Alimentos ME', '04924507814', 'SP'),
 ('60551543000129', 'Alexandre e Anthony Eletrônica Ltda', '14928515668', 'SP'),
 ('16471414000139', 'Theo e Stefany Limpeza ME', '35574822008', 'AL'),
 ('60076179000192', 'Nicole e Lara Ferragens Ltda', '89458105285', 'AL'),
 ('05225673000163', 'Daniel e Alícia Advocacia ME', '42717588841', 'DF'),
 ('39780506000104', 'Daniel e Brenda Financeira Ltda', '27605785690', 'DF')]

In [ ]:
%%sql
select * from carros.garagens;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('16471414000139', 7, '16', 2),
 ('60076179000192', 10, '26', 5),
 ('05225673000163', 5, '21', 12),
 ('39780506000104', 8, '05', 4),
 ('60551543000129', 3, '21', 2)]

In [ ]:
%%sql
select * from carros.negocios;

 * postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[('04924507814', '64790774000146', 1, '10', datetime.date(2025, 10, 27), Decimal('30000.00')),
 ('65991658773', '60551543000129', 3, '21', datetime.date(2025, 10, 27), Decimal('100000.00')),
 ('14928515668', '16471414000139', 7, '16', datetime.date(2025, 10, 27), Decimal('110000.00')),
 ('89458105285', '60076179000192', 10, '26', datetime.date(2025, 10, 27), Decimal('50000.00')),
 ('53331021474', '05225673000163', 5, '21', datetime.date(2025, 10, 27), Decimal('2000.00')),
 ('66984125898', '39780506000104', 8, '05', datetime.date(2025, 10, 27), Decimal('14209.00'))]

Deletes

In [ ]:
%%sql

delete from carros.garagens where cnpj_revendedora = '64790774000146';

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[]

Updates

In [ ]:
%%sql
update carros.garagens
  set quantidade = quantidade - 1
where cnpj_revendedora = '60551543000129' and codigo_automovel = 03 and ano = '21';

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[]

Restrições

In [ ]:
%%sql
insert into carros.automoveis
values
(01, '10', 'Fiat', 'Uno Mile', 20000, 'Italia')
;

 * postgresql://postgres:***@localhost:5432/postgres
(psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "pk_automoveis"
DETAIL:  Key (codigo, ano)=(1, 10) already exists.

[SQL: insert into carros.automoveis
values
(01, '10', 'Fiat', 'Uno Mile', 20000, 'Italia')
;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [ ]:
%%sql
insert into carros.negocios
values
('14928515668', '16471414000139', 07, '16', '2025-10-27', 110000)
;

 * postgresql://postgres:***@localhost:5432/postgres
(psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "pk_negocios"
DETAIL:  Key (cpf_comprador, cnpj_revendedora, codigo_automovel, ano)=(14928515668, 16471414000139, 7, 16) already exists.

[SQL: insert into carros.negocios
values
('14928515668', '16471414000139', 07, '16', '2025-10-27', 110000)
;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [ ]:
%%sql
insert into carros.negocios
values
('14928515668', '16471414000139', 06, '16', '2025-10-27', 110000)
;

 * postgresql://postgres:***@localhost:5432/postgres
(psycopg2.errors.ForeignKeyViolation) insert or update on table "negocios" violates foreign key constraint "fk_negocios_automoveis"
DETAIL:  Key (codigo_automovel, ano)=(6, 16) is not present in table "automoveis".

[SQL: insert into carros.negocios
values
('14928515668', '16471414000139', 06, '16', '2025-10-27', 110000)
;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

**Parte 1: Modelagem Conceitual**

Segue SUGESTÃO de solução de modelagem conceitual ER usando a ferramenta BRmodelo.

https://drive.google.com/file/d/10-lx_mCLC4svbnopnlBKxtfsBJGqdbXt/view?usp=sharing